[
  {
      "id": 3001,
      "name": "Minestrone Soup",
      "category": "soup",
      "summary": "Quick and easy and delicious",
      "img": {
        "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/11/1/2/FNM_120110-Ask-Ellie-001_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382539602880.jpeg",
        "height": 200,
        "width": 400
      },
      "level": "Easy",
      "time": "45 min",
      "yield": 6,
      "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1 large onion, diced",
        "4 cloves garlic, minced",
        "2 stalks celery, diced",
        "1 large carrot, diced",
        "1/3 pound green beans, trimmed and cut into 1/2-inch pieces (about 1 1/2 cups)",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "Kosher salt and freshly ground pepper",
        "28-ounce can no-salt-added diced tomatoes",
        "14-ounce can crushed tomatoes",
        "6 cups low-sodium chicken broth",
        "15-ounce can low-sodium kidney beans, drained and rinsed",
        "1 cup elbow pasta",
        "1/3 cup finely grated parmesan cheese",
        "2 tablespoons chopped fresh basil"
      ],
      "directions": [
        "Heat the olive oil in a large pot over medium-high heat. Add the onion and cook until translucent, about 4 minutes. Add the garlic and cook 30 seconds. Add the celery and carrot and cook until they begin to soften, about 5 minutes. Stir in the green beans, dried oregano and basil, 3/4 teaspoon salt, and pepper to taste; cook 3 more minutes.",
        "Add the diced and crushed tomatoes and the chicken broth to the pot and bring to a boil. Reduce the heat to medium low and simmer 10 minutes. Stir in the kidney beans and pasta and cook until the pasta and vegetables are tender, about 10 minutes. Season with salt. Ladle into bowls and top with the parmesan and chopped basil."
      ]
    },
  {
    "id": 3002,
    "name": "Taco Soup",
    "category": "soup",
    "summary": "Best taco soup recipe ever! Super easy and super tasty! Thanks for making cooking easy.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/11/23/0/FN_taco-soup-010_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371602869888.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "time": "6 hr 15 min",
    "yield": 12,
    "ingredients": [
      "2 pounds ground beef",
      "2 cups diced onions",
      "15 1/2-ounce cans pinto beans",
      "15 1/2-ounce can pink kidney beans",
      "15 1/4-ounce can whole kernel corn, drained",
      "14 1/2-ounce can Mexican-style stewed tomatoes",
      "14 1/2-ounce can diced tomatoes",
      "14 1/2-ounce can tomatoes with chiles",
      "4 1/2-ounce cans diced green chiles",
      "4.6-ounce can black olives, drained and sliced, optional",
      "1/2 cup green olives, sliced, optional",
      "1 1/4-ounce package taco seasoning mix",
      "1-ounce package ranch salad dressing mix",
      "Corn chips, for serving",
      "Sour cream, for garnish",
      "Grated cheese, for garnish",
      "Chopped green onions, for garnish",
      "Pickled jalapenos, for garnish"
    ],
    "directions": [
      "Brown the ground beef and onions in a large skillet; drain the excess fat, then transfer the browned beef and onions to a large slow cooker or a stockpot. Add the beans, corn, tomatoes, green chiles, black olives, green olives, taco seasoning, and ranch dressing mix, and cook in a slow cooker on low for 6 to 8 hours or simmer over low heat for about 1 hour in a pot on the stove. To serve, place a few corn chips in each bowl and ladle soup over them. Top with sour cream, cheese, green onions and jalapenos."
    ]
  },
  {
    "id": 3003,
    "name": "Chicken Tortilla Soup",
    "category": "soup",
    "summary": "Good base recipe - I added cumin, chili powder, red pepper flakes, hot sauce and 2 bay leaves to sauté into the onion and jalapeño. Added a can of sweet corn and only used one lime.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/6/11/0/RB0112_Chicken-Tortilla-Soup.jpg.rend.hgtvcom.826.620.suffix/1371587417881.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "time": "35 min",
    "yield": 5,
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 small onion, diced",
      "2 tablespoons minced garlic",
      "2 jalapenos, finely diced",
      "6 cups low-sodium chicken broth",
      "One 14.5-ounce can fire-roasted diced tomatoes",
      "One 14.5-ounce can black beans, rinsed and drained",
      "3 chicken breasts, boneless and skinless",
      "2 limes, juiced, plus wedges for garnish",
      "Salt and freshly ground black pepper",
      "1 cup roughly chopped fresh cilantro leaves",
      "One 8-inch flour tortilla, grilled, cut into thin strips",
      "1 avocado, pitted, sliced",
      "1 cup shredded Monterrey cheese"
    ],
    "directions": [
      "Heat the olive oil in a large pot over medium-high heat. Add the onion and cook until translucent, about 4 minutes. Add the garlic and cook 30 seconds. Add the celery and carrot and cook until they begin to soften, about 5 minutes. Stir in the green beans, dried oregano and basil, 3/4 teaspoon salt, and pepper to taste; cook 3 more minutes.",
      "Add the diced and crushed tomatoes and the chicken broth to the pot and bring to a boil. Reduce the heat to medium low and simmer 10 minutes. Stir in the kidney beans and pasta and cook until the pasta and vegetables are tender, about 10 minutes. Season with salt. Ladle into bowls and top with the parmesan and chopped basil."
    ]
  },
  {
    "id": 3004,
    "name": "Lentil Soup",
    "category": "soup",
    "summary": "This was actually delicious and very hearty. I used red split lentils from Trader Joe's and 4 cups of water and a veggie bouillon cube instead of the suggested two quarts of broth. Also added a dash of red pepper flakes instead of grains of paradise.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2007/1/19/0/ea1015_soup1.jpg.rend.hgtvcom.826.620.suffix/1382538506113.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Intermediate",
    "time": "1 hr 15 min",
    "yield": 7,
    "ingredients": [
      "2 tablespoons olive oil",
      "1 cup finely chopped onion",
      "1/2 cup finely chopped carrot",
      "1/2 cup finely chopped celery",
      "2 teaspoons kosher salt",
      "1 pound lentils, picked and rinsed",
      "1 cup peeled and chopped tomatoes",
      "2 quarts chicken or vegetable broth",
      "1/2 teaspoon freshly ground coriander",
      "1/2 teaspoon freshly ground toasted cumin",
      "1/2 teaspoon freshly ground grains of paradise"
    ],
    "directions": [
      "Place the olive oil into a large 6-quart Dutch oven and set over medium heat. Once hot, add the onion, carrot, celery and salt and sweat until the onions are translucent, approximately 6 to 7 minutes. Add the lentils, tomatoes, broth, coriander, cumin and grains of paradise and stir to combine. Increase the heat to high and bring just to a boil. Reduce the heat to low, cover and cook at a low simmer until the lentils are tender, approximately 35 to 40 minutes. Using a stick blender, puree to your preferred consistency. Serve immediately."
    ]
  },
  {
    "id": 3005,
    "name": "Butternut Squash Soup",
    "category": "soup",
    "summary": "Easy to make and pretty fast, but thought it was too liquidy. Would suggest to use less broth or more squash to thicken it up.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/11/23/1/FN_butternut-soup-008_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371602919396.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Intermediate",
    "time": "1 hr",
    "yield": 6,
    "ingredients": [
      "2- to 3-pound butternut squash, peeled and seeded",
      "2 tablespoons unsalted butter",
      "1 medium onion, chopped",
      "6 cups chicken stock",
      "Nutmeg",
      "Salt and freshly ground black pepper"
    ],
    "directions": [
      "Cut squash into 1-inch chunks. In large pot melt butter. Add onion and cook until translucent, about 8 minutes. Add squash and stock. Bring to a simmer and cook until squash is tender, about 15 to 20 minutes. Remove squash chunks with slotted spoon and place in a blender and puree. Return blended squash to pot. Stir and season with nutmeg, salt, and pepper. Serve."
    ]
  },
  {
    "id": 3006,
    "name": "Garden Vegetable Soup",
    "category": "soup",
    "summary": "I love this garden vegetable soup! Very tasty and healthy. Thank you for posting.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2009/6/15/1/JI_28714_s4x3.jpg.rend.hgtvcom.826.620.suffix/1397748095589.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Intermediate",
    "time": "1 hr 25 min",
    "yield": 6,
    "ingredients": [
      "4 tablespoons olive oil",
      "2 cups chopped leeks, white part only (from approximately 3 medium leeks)",
      "2 tablespoons finely minced garlic",
      "Kosher salt",
      "2 cups carrots, peeled and chopped into rounds (approximately 2 medium)",
      "2 cups peeled and diced potatoes",
      "2 cups fresh green beans, broken or cut into 3/4-inch pieces",
      "2 quarts chicken or vegetable broth",
      "4 cups peeled, seeded, and chopped tomatoes",
      "2 ears corn, kernels removed",
      "1/2 teaspoon freshly ground black pepper",
      "1/4 cup packed, chopped fresh parsley leaves",
      "1 to 2 teaspoons freshly squeezed lemon juice"
    ],
    "directions": [
      "Heat the olive oil in large, heavy-bottomed stockpot over medium-low heat. Once hot, add the leeks, garlic, and a pinch of salt and sweat until they begin to soften, approximately 7 to 8 minutes. Add the carrots, potatoes, and green beans and continue to cook for 4 to 5 more minutes, stirring occasionally.",
      "Add the stock, increase the heat to high, and bring to a simmer. Once simmering, add the tomatoes, corn kernels, and pepper. Reduce the heat to low, cover, and cook until the vegetables are fork tender, approximately 25 to 30 minutes. Remove from heat and add the parsley and lemon juice. Season, to taste, with kosher salt. Serve immediately."
    ]
  },
  {
      "id": 2001,
      "name": "Standing Rib Roast",
      "category": "Chrismas Recipe",
      "summary": "easy but amazing meat for the home to share.",
      "img": {
        "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/12/20/0/LR0603H_standing-rib-roast_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382543820243.jpeg",
        "height": 200,
        "width": 400
      },
      "level": "Easy",
      "totaltime": "3 hr 20 min",

      "yield": "8",
      "ingredients": [
        "1/2 teaspoon cayenne pepper",
        "1/2 bunch rosemary, leaves finely chopped",
        "3 cloves garlic, smashed and finely chopped",
        "Extra-virgin olive oil",
        "1 (8 to 8 1/2-pound) bone-in standing rib roast",
        "Kosher salt",
        "1 onion, cut into 1/2-inch dice",
        "1 pound baby carrots, tops trimmed",
        "3 ribs celery, cut into 1/2-inch dice",
        "1 pound cremini mushrooms, stems removed and quartered",
        "1 cup red wine",
        "2 cups rich chicken stock",
        "2 bay leaves"
        
      ],

      "directions": [
        "Preheat the oven to 450 degrees F.",
        "In a small bowl combine the cayenne, rosemary, and garlic. Add enough olive oil until it becomes a loose paste. Schmear the roast with the rosemary-garlic paste and really massage it into the meat. Season generously with kosher salt.",
        "Put the onions, baby carrots, celery and mushrooms in the bottom of a roasting pan. Toss with a little olive oil and salt, to taste. Add the wine, 1 cup of chicken stock and the bay leaves. Put the roast on top of the veggies and put into the preheated oven until the roast is really brown and lovely, about 25 to 30 minutes. Reduce the heat to 350 degrees F for another 1 3/4 to 2 hours. Occasionally during the cooking time, spoon some of the juices over the meat. If the liquid level in the pan goes down too much, add the remaining 1 cup of stock. It also would be a great idea to rotate the roasting pan about halfway through the cooking process.",
        "Check the temperature of the meat by inserting an instant-read thermometer into the center of the roast. For medium-rare it should be 125 degrees F and 130 for medium. Remove the roast from the oven to a cutting board and let it rest for 15 to 20 minutes before carving.",
        "Taste the veggies in the pan juices and season with salt, to taste, if needed. Skim off any excess fat.",
        "Slice the roast and arrange on a serving platter. Serve with the veggies and the pan juices."
        
      ]
    },
  {
    "id": 2002,
    "name": "Pizza Wreath",
    "category": "Chrismas Recipe",
    "summary": "A sausage and pepperoni pizza morphs into a festive wreath for the holiday season. Top with a golden-brown dough bow and sprinkle with fresh basil for a dish that's almost too cute to eat",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/8/16/2/FNK_Pizza-Wreath_s4x3.jpg.rend.hgtvcom.826.620.suffix/1471414091994.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "1 hr 50 min",

    "yield": 9,
    "ingredients": [
      "2 tablespoons extra-virgin olive oil",
      "2 cloves garlic, minced",
      "1/2 small yellow onion, finely diced",
      "One 14.5-ounce can whole peeled tomatoes, crushed well",
      "1 1/2 cups loosely packed fresh basil leaves",
      "Kosher salt and freshly ground black pepper",
      "1/2 pound sweet Italian sausage, casings removed",
      "Two 1-pound balls refrigerated pizza dough, at room temperature",
      "All-purpose flour, for dusting",
      "1/2 cup sliced pepperoni, roughly chopped",
      "1 cup (about 4 ounces) shredded mozzarella",
      "1 large egg, beaten",
      "Pinch of crushed red chile flakes"
      
    ],

    "directions": [
      "Special equipment: a 3-inch round biscuit or cookie cutter",
      "Set a pizza stone or an inverted baking sheet on a rack in the center of the oven and preheat the oven to 400 degrees F. Invert another baking sheet and line it with parchment paper; set aside.",
      "Add 1 tablespoon of the oil, then the garlic and onion to a small saucepan over medium heat and cook until the vegetables are tender, about 5 minutes. Add the crushed tomatoes, 1/2 cup basil leaves, 1 teaspoon salt and few grinds of black pepper and bring to a boil. Reduce the heat and simmer the sauce, uncovered, until the flavors are concentrated and the sauce has thickened, about 25 minutes. ",
      "While the sauce cooks, add the remaining tablespoon oil to a small saute pan over medium heat. Add the sausage and cook, breaking it up with a spoon, until browned in spots and completlety cooked through, about 5 minutes. Remove from the heat to cool.",
      "Roll out and stretch the dough into two 12-inch rounds on a lightly floured surface. Use a 3-inch round biscuit or cookie cutter and punch a hole in the center of each round to make rings. (Set aside the holes.) ",
      "Put one of the rings onto the parchment-lined baking sheet. Spoon all but 1 tablespoon of the sauce on one dough ring in an even layer.Sprinkle over the sausage, pepperoni and all but 1 tablespoon of the mozzarella, leaving a 1/2-inch border around the edges. Gently place the other dough ring directly on top, and pinch the edges to seal in the filling.",
      "Use a paring knife, cut 1- to 1 1/2-inch-wide strips into the wreath all around, like rays of the sun. (Be careful not to cut all the way through to the center; the wreath should stay intact and hold its shape once it is baked. You should have about 24 strips total.) Gently turn each strip twice to create a twist, then press the edges down on the parchment. Repeat this motion until all of the strips have been twisted.",
      "To make a bow, roll out and stretch the two dough cut-out holes into 6-inch long rectangles. Top one with the remaining tomato sauce and mozzarella. Place the other dough rectangle directly on top and press to seal the edges. Twist the dough with both hands in opposite directions for one full turn to form a bow that will hold its shape. Press the edges down to seal and set the bow on the prepared baking sheet next to the wreath.",
      "In a small bowl, whisk the egg with a few drops of water. Use a pastry brush to brush the bow and wreath with the egg wash, and sprinkle with a pinch of salt. Place the baking sheet with the wreath on top of the preheated stone and bake until the bow is cooked through and golden brown, about 20 minutes. Remove the bow and continue to bake the wreath until golden brown, firm to the touch and cooked through, about 25 minutes more. Chop the remaining cup fresh basil. Position the bow on the bottom of the wreath, sprinkle basil all over the wreath and top with a pinch of crushed red chile flakes."
            
    ]
  },
  {
    "id": 2003,
    "name": "Gigantic Standing Snowman",
    "category": "Chrismas Recipe",
    "summary": "This impressive centerpiece is perfect for feeding a crowd at your ugly sweater party this holiday season. Coated with a meringue frosting, these bite-size cupcakes are as light as snow and easy to pull off and enjoy during the festivities.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2018/8/1/0/FNK_GIGANTIC-SNOWMAN-H_s4x3.jpg.rend.hgtvcom.826.620.suffix/1533148373067.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Intermediate",
    "totaltime": "4 hr",

    "yield": 55,
    "ingredients": [
      "Snowman:",
      "Four 15.25-ounce boxes white cake mix (plus required ingredients for egg whites version)",
      "2 cups white candy melting wafers",
      "1 tablespoon prepared vanilla frosting",
      "1 cup orange candy melting wafers",
      "5 chocolate-covered marshmallow cookies, such as Mallomars",
      "Two 9-inch-long strands plus ten 3-foot-long strands rainbow sour candy strips or belts",
      "2 cake doughnuts",
      "Frosting:",
      "2 1/4 cups sugar",
      "2 tablespoons lemon juice",
      "Pinch fine salt",
      "12 large egg whites"
      
    ],

    "directions": [
      "Special equipment: mini muffin tins; about 240 mini white cupcake liners, a large base (about 15 by 20 inches) for building the snowman, such as a foam poster board; a large pastry bag; a medium star tip; up to 300 toothpicks; a 10-inch Styrofoam sphere; a 7-inch Styrofoam sphere; about six 12-inch wooden skewers",
      "For the snowman: Preheat the oven to 350 degrees F. Line mini muffin tins with white mini cupcake liners.",
      "Prepare the cake batter according to the package directions for using egg whites. Fill each cupcake liner halfway with batter. Bake until a toothpick inserted into the center comes out clean, 10 to 12 minutes. Transfer to a cooling rack to cool completely, about 30 minutes. Repeat with the remaining cake batter (you should have about 240 cupcakes total). ",
      "Microwave the white candy melting wafers in a medium microwave-safe bowl in 30-second intervals, stirring in between each, until melted, about 1 minute. Pour 2 tablespoons of the melted candy onto the center of a large serving platter or serving board (such as a 15-by-20-inch foam poster board). Place a 10-inch Styrofoam sphere on top of the candy and let set until hardened, about 10 minutes. This will be the bottom round of the snowman.",
      "Trim 2 inches off the flat end of three 12-inch wooden skewers, making sure that the skewers are even in length. Mark the center of the sphere and poke the 3 skewers, bundled together, into the center flat-end first, leaving about half the length of the skewers sticking out of the top. Align a 7-inch Styrofoam sphere on top and in the center of the 10-inch sphere and press down so the skewers are inserted into the smaller sphere, securing the snowman head to the bottom. Leave a 1-inch gap between the 2 spheres.",
      "Set aside 5 cupcakes for making the nose later. Coat the bottom of 16 cupcakes with the melted candy (reheating as necessary) and wedge them around the base of the bottom sphere so they are in contact with the board, creating a ring of cupcakes to keep the base from moving. ",
      "Poke a toothpick through the top center of each of the remaining cupcakes until the toothpick pokes out of the other side. Coat the bottom of one cupcake with some of the melted candy. Starting at the bottom of the snowman, hold the top of the toothpick and poke the cupcake into the side of the sphere, offset between the row of cupcakes below, so that the toothpick is no longer showing and the coated bottom is pressed against the sphere. Working in batches so that the melted candy does not harden (and reheating as necessary), repeat with the remaining cupcakes until the bottom and head of the snowman are completely covered with cupcakes.",
      "To make the carrot nose: Crumble the reserved 5 cupcakes into as fine a crumb as possible in a medium bowl. Add the vanilla frosting to the bowl and mix until well combined and the mixture can be formed into a stiff ball. Mold into a 4-inch carrot shape. Cut a 12-inch wooden skewer in half; discard the half without the point. Insert the skewer half lengthwise through the center of the carrot with the pointed end sticking out of the flat side of the carrot. Freeze until solid, about 30 minutes. ",
      "Microwave the orange candy melting wafers in a medium microwave-safe bowl in 30-second intervals, stirring in between each, until melted, 1 to 2 minutes. Dip the frozen carrot into the orange candy until completely coated. Transfer to a parchment-lined dish until hardened, about 15 minutes. ",
      "Attach the carrot nose to the center of the face with the pointed end of the skewer, pressing in until the skewer is no longer visible and the carrot is straight. ",
      "For the frosting: Bring a few inches of water to a boil in a saucepan that can hold a heatproof stand mixer bowl above the water without the bottom of the bowl touching. Add the sugar, lemon juice, salt and egg whites to the mixer bowl and whisk together by hand. Set the bowl above the boiling water and whisk until the mixture is warm to the touch and the sugar is completely dissolved. Transfer to the stand mixer fitted with the whisk attachment and beat at medium-high speed until the mixture is cool and holds stiff peaks, 10 to 15 minutes.",
      "Transfer a quarter of the frosting to a large pastry bag fitted with a medium star tip. Pipe rosettes onto each cupcake starting in the center and swirling outwards until the entire cupcake is covered with frosting, refilling the pastry bag with frosting as needed. ",
      "To make the eyes and buttons: Cut 3 toothpicks in half and discard one of the halves. Stick the pointed end of each remaining toothpick half into the back of a chocolate-covered marshmallow cookie, making sure it doesn't poke through the front. On the head where the eyes would be, attach 2 marshmallow cookies to 2 cupcakes with the toothpicks. Attach 3 marshmallow cookies to 3 cupcakes down the front of the snowman where the buttons would be.",
      "To make the ear muffs: Cut two 12-inch wooden skewers in half; discard the ends without the point. Insert a skewer point-side first into each side of the snowman head even with the eyes. Trim any excess skewer to leave 1 inch exposed. Attach a doughnut to each side of the head by pressing the doughnut into the skewer until it is flush with the head and pressing against the frosted cupcakes. Lay the two 9-inch sour candy strands next to each other across the top of the head to attach the ear muffs. Trim any excess if needed.",
      "To make the woven scarf: Stack four 3-foot-long sour candy strands on top of each other and position vertically in front of you. Measure 4 inches down from the top of the strands and insert a toothpick through all 4 pieces to attach them at the top. Separate the strands below the toothpick so they are no longer stacked on top of each other. Interlace the far-right strand first under the strand next to it, then over the strand next to that and finally under the last strand (on the left) to create the first weave, tightening as you go to create a snug pattern. Continue the pattern by bringing the same strand back over the strand closest to it, then under the next strand and finally over the last strand on the far right.",
      "Repeat this pattern--weaving side to side and back again--until the strand has been completely woven through. Using a toothpick, attach another 3-foot strand where the original one left off and continue until the new strand is woven through. Cut the remaining unwoven strands at the bottom. Use toothpicks to secure the scarf. Repeat this process, starting with four new 3-foot sour candy strands and weaving in a fifth, to create 2 woven scarf halves equal in length. ",
      "Fray the unwoven section at the top of the scarf halves by pulling the different colors apart. Attach one of the scarf halves to the back of the snowman, securing it with toothpicks. Wrap the scarf carefully around to the front of the snowman so the frayed end drapes near the buttons. Secure the other scarf half, overlapping in the back if needed, and wrap around to the front of the body so the ends of the scarves overlap. ",
      "Keep chilled until serving. Serve within a day."
      
    ]
  },
  {
    "id": 2004,
    "name": "Potato-Beef Canapes",
    "category": "Chrismas Recipe",
    "summary": "the mix of potatoes and beef, which is delicious and enjoyful.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2012/11/13/5/FNM_1201120-Potato-Beef-Canapes_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382545798765.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "1 hr 10 min",

    "yield": 8,
    "ingredients": [
      "1 1/2 pounds beef tenderloin",
      "Kosher salt and freshly ground pepper",
      "Kosher salt and freshly ground pepper",
      "2 tablespoons extra-virgin olive oil",
      "5 small red-skinned potatoes, sliced 1/4 inch thick",
      "2/3 cup jarred roasted red peppers, drained, rinsed and diced",
      "1 small shallot, minced",
      "1 tablespoon red wine vinegar",
      "1 teaspoon capers, chopped",
      "1/4 teaspoon finely grated garlic",
      "1/4 teaspoon finely chopped fresh rosemary",
      "Large pinch of sugar"

      
    ],

    "directions": [
      "Preheat the oven to 350 degrees F. Season the meat with salt and pepper. Heat 1 tablespoon olive oil in a small ovenproof skillet over medium-high heat. Add the beef and brown on all sides, about 6 minutes. Transfer the skillet to the oven; roast until a thermometer inserted into the meat registers 125 degrees F, about 30 minutes. Transfer to a cutting board; let rest 15 minutes." ,
      "Meanwhile, put the potatoes in a saucepan, cover with cold water and add salt. Bring to a boil, then reduce the heat and simmer until just tender, up to 5 minutes. Drain and let cool. ",
      "Mix the roasted peppers, shallot, vinegar, the remaining 1 tablespoon olive oil, the capers, garlic, rosemary, sugar, and salt and pepper to taste in a bowl. Thinly slice the beef and arrange on the potato rounds; top with the pepper salsa. Serve warm or at room temperature. "
            
    ]
  },
  {
    "id": 2005,
    "name": "Horseradish Shrimp",
    "category": "Chrismas Recipe",
    "summary": "Most delicious shrimp! And so simple! Very difficult to screw this one up.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2012/11/13/5/FNM_120112-Horseradish-Shrimp-Recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382545802414.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "50 min",

    "yield": 8,
    "ingredients": [
      "1/4 cup tomato paste",
      "1/4 cup horseradish, drained",
      "3 tablespoons extra-virgin olive oil, plus more for brushing",
      "3/4 teaspoon hot sauce",
      "Kosher salt and freshly ground pepper",
      "2 pounds large shrimp, peeled and deveined (tails left on)",
      "Lemon wedges, for serving"
      
    ],

    "directions": [
      "Mix the tomato paste, horseradish, olive oil, hot sauce, 1 1/2 teaspoons salt, and pepper to taste in a large bowl; add the shrimp and toss. Cover and refrigerate 30 minutes to 1 hour.",
      "Preheat the broiler. Brush a rimmed baking sheet with olive oil. Spread out the shrimp on the baking sheet and broil until just cooked through, 4 to 8 minutes (no need to turn). Serve warm or at room temperature with lemon wedges."
        
    ]
  },
  {
    "id": 2006,
    "name": "Savory Cheese Palmiers",
    "category": "Chrismas Recipe",
    "summary": "easy and decilious snake.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/2/18/0/SHM-Cookbook_Savory-Cheese-Palmiers_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382539805473.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "1 hr",

    "yield": 12,
    "ingredients": [
      "6 tablespoons grated Parmesan cheese",
      "1/2 (17.3-ounce) box frozen puff pastry, thawed (recommended: Pepperidge Farms)",
      "1 egg, lightly beaten",
      "1 tablespoon water",
      "1/4 cup shredded Italian cheese blend",
      "1 teaspoon paprika"
      
    ],

    "directions": [
      "Sprinkle work surface with some of the grated Parmesan cheese. Unfold a thawed sheet of puff pastry on top of the cheese. Brush the pastry with egg wash made from 1 egg beaten with 1 tablespoon water.",
      "Combine 2 tablespoons Parmesan cheese, shredded Italian cheese blend, and 1 teaspoon paprika. Sprinkle over the surface. Press into the pastry.",
      "Fold the top and bottom edge of the pastry to the center. Fold the pastry in half, from left to right. Fold in half, top to bottom. Cover and refrigerate 30 minutes.",
      "Preheat the oven to 350 degrees F.",
      "Cut 1/8-inch thick slices, starting at shortest edge. Dip flat faces of palmiers in remaining Parmesan and lay on baking sheet. Bake for 20 minutes, or until golden brown."
    ]
  },

  {
      "id": 1001,
      "name": "Perfect Roast Turkey",
      "category": "thanksgiving recipe",
      "summary": "This recipe creates the BEST Thanksgiving turkey. Not dry and yummy all over!",
      "img": {
        "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/11/24/0/IG1C11_Roast-Turkey.jpg.rend.hgtvcom.826.620.suffix/1382538696807.jpeg",
        "height": 200,
        "width": 400
      },
      "level": "Intermediate",
      "totaltime": "3 hr 20 min",

      "yield": 8,
      "ingredients": [
        "1/4 pound (1 stick) unsalted butter",
        "1 lemon, zested and juiced",
        "1 teaspoon chopped fresh thyme leaves",
        "1 fresh turkey (10 to 12 pounds)",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 large bunch fresh thyme",
        "1 whole lemon, halved",
        "1 Spanish onion, quartered",
        "1 head garlic, halved crosswise"
      ],

      "directions": [
        "Preheat the oven to 350 degrees F.",
        "Melt the butter in a small saucepan. Add the zest and juice of the lemon and 1 teaspoon of thyme leaves to the butter mixture. Set aside.",
        "Take the giblets out of the turkey and wash the turkey inside and out. Remove any excess fat and leftover pinfeathers and pat the outside dry. Place the turkey in a large roasting pan. Liberally salt and pepper the inside of the turkey cavity. Stuff the cavity with the bunch of thyme, halved lemon, quartered onion, and the garlic. Brush the outside of the turkey with the butter mixture and sprinkle with salt and pepper. Tie the legs together with string and tuck the wing tips under the body of the turkey.",
        "Roast the turkey about 2 1/2 hours, or until the juices run clear when you cut between the leg and the thigh. Remove the turkey to a cutting board and cover with aluminum foil; let rest for 20 minutes.",
        "Slice the turkey and serve."
      ]
    },

  {
    "id": 1002,
    "name": "The Best Sweet Potato Casserole",
    "category": "thanksgiving recipe",
    "summary": "A chuckle for the posts that say.. \"after I altered the entire recipe, we loved it.\"",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/4/12/1/FNK_Sweet-Potato-Casserole_s4x3.jpg.rend.hgtvcom.826.620.suffix/1460503592924.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "60 min",

    "yield": 7,
    "ingredients": [
      "1/2 stick (4 tablespoons) unsalted butter, melted, plus more for buttering the baking dish",
      "3 to 4 large sweet potatoes (about 1 3/4 pounds), peeled and cubed ",
      "1/2 cup milk",
      "1/4 cup brown sugar, packed",
      "1 teaspoon pure vanilla extract",
      "1/2 teaspoon kosher salt",
      "2 large eggs",
      "1/2 cup all-purpose flour",
      "1/2 cup brown sugar, packed",
      "1/2 stick (4 tablespoons) unsalted butter, melted",
      "1/4 teaspoon kosher salt",
      "3/4 cup chopped pecans"
    ],

    "directions": [
      "For the sweet potatoes: Add 1 3/4 pounds peeled and cubed sweet potatoes to a large pot of salted water. Bring to a boil over high heat, then lower the heat to a simmer and cook until the potatoes are very tender, 15 to 20 minutes. Drain and cool. Mash the sweet potatoes.",
      "For the filling: Preheat the oven to 350 degrees F. Butter a 2-quart baking dish.",
      "Whisk together the butter, mashed sweet potatoes, milk, brown sugar, vanilla, salt and eggs in a large bowl. Transfer to the prepared baking dish.",
      "For the topping: Combine the flour, brown sugar, butter and salt in a medium bowl until moist and the mixture clumps together. Stir in the pecans. Spread the mixture over the top of the sweet potatoes in an even layer. Bake until mostly set in the center and golden on top, 25 to 30 minutes. Serve hot."
    ]
  },

  {
    "id": 1003,
    "name": "Balsamic-Roasted Brussels Sprouts",
    "category": "thanksgiving recipe",
    "summary": "Absolutely delicious! I’ve made this recipe at least 10 times and can’t wait for the next excuse to make it again!",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/3/26/0/BX0808H_balsamic-roasted-brussels-sprouts-recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1402583469880.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "50 min",

    "yield": 6,
    "ingredients": [
      "1 1/2 pounds Brussels sprouts, trimmed and cut in half through the core",
      "4 ounces pancetta, 1/4-inch-diced",
      "1/4 cup good olive oil",
      "Kosher salt and freshly ground black pepper",
      "1 tablespoon syrupy balsamic vinegar"
    ],

    "directions": [
      "Preheat the oven to 400 degrees. ",
      "Place the Brussels sprouts on a sheet pan, including some of the loose leaves, which get crispy when they're roasted.",
      "Add the pancetta, olive oil, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper, toss with your hands, and spread out in a single layer.",
      "Roast the Brussels sprouts for 20 to 30 minutes, until they're tender and nicely browned and the pancetta is cooked. ",
      "Toss once during roasting. Remove from the oven, drizzle immediately with the balsamic vinegar, and toss again.",
      "Taste for seasonings, and serve hot!"
    ]
  },

  {
    "id": 1004,
    "name": "Perfect Cranberry Sauce",
    "category": "thanksgiving recipe",
    "summary": "Hands down the best cranberry sauce recipe!  Perfect every time and it is always a hit with the family.  ",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2009/9/25/0/FNM-110109-Centerfold-006_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382539090248.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "37 min",

    "yield": 4,
    "ingredients": [
      "12-ounce of fresh or frozen cranberries",
      "1 cup sugar",
      "1 strip orange or lemon zest",
      "2 tablespoons water"
    ],

    "directions": [
      "Empty a 12-ounce bag of fresh or frozen cranberries into a saucepan and transfer 1/2 cup to a small bowl.",
      "Add 1 cup sugar, 1 strip orange or lemon zest and 2 tablespoons water to the pan and cook over low heat, stirring occasionally, until the sugar dissolves and the cranberries are soft, about 10 minutes.",
      "Increase the heat to medium and cook until the cranberries burst, about 12 minutes.",
      "Reduce the heat to low and stir in the reserved cranberries.",
      "Add sugar, salt and pepper to taste and cool to room temperature before serving."
    ]
  },

  {
    "id": 1005,
    "name": "Sausage and Herb Stuffing",
    "category": "thanksgiving recipe",
    "summary": "I Love This Recipe! But I double all the other ingredients except the bread to make the ratios better or half the amount of bread. ",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/8/10/0/Thanksgiving-2011_BX0105-sausage-and-herb-stuffing_s4x3.jpg.rend.hgtvcom.826.620.suffix/1384540899189.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Intermediate",
    "totaltime": "1 hr 22 min",

    "yield": 9,
    "ingredients": [
      "16 cups 1-inch bread cubes, white or sourdough (1 1/2 pound loaf)",
      "8 tablespoons (1 stick) unsalted butter",
      "2 cups medium-diced yellow onion (2 onions)",
      "1 cup medium-diced celery (2 stalks)",
      "2 Granny Smith apples, unpeeled, cored and large-diced",
      "2 tablespoons chopped flat-leaf parsley",
      "1 tablespoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "3/4 pound sweet or spicy Italian sausage, casings removed",
      "1 cup chicken stock",
      "1 cup dried cranberries"
    ],

    "directions": [
      "Preheat the oven to 300 degrees F.",
      "Place the bread cubes in a single layer on a sheet pan and bake for 7 minutes. Raise the oven temperature to 350 degrees F. Remove the bread cubes to a very large bowl.",
      "Meanwhile, in a large saute pan, melt the butter and add the onions, celery, apples, parsley, salt and pepper. Saute over medium heat for 10 minutes, until the vegetables are softened. Add to the bread cubes.",
      "In the same saute pan, cook the sausage over medium heat for about 10 minutes, until browned and cooked through, breaking up the sausage with a fork while cooking. Add to the bread cubes and vegetables.",
      "Add the chicken stock and cranberries to the mixture, mix well, and pour into a 9 by 12-inch baking dish. Bake for 30 minutes, until browned on top and hot in the middle. Serve warm."
    ]
  },

  {
    "id": 1006,
    "name": "Mashed Potatoes",
    "category": "thanksgiving recipe",
    "summary": "Delish and easy! It’s a no brainer. Some mashies have so many ingredients. I wanted something easy and not too many ingredients and this delivered!! Sometimes no fuss is best!",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/9/3/0/mashedpotatoes_s4x3.jpg.rend.hgtvcom.826.620.suffix/1384541148269.jpeg",
      "height": 200,
      "width": 400
    },
    "level": "Easy",
    "totaltime": "35 min",

    "yield": 7,
    "ingredients": [
      "4 pounds golden creamer potatoes, peeled and cut into quarters",
      "1 bay leaf",
      "Kosher salt and freshly ground black pepper",
      "2 cups heavy cream",
      "3 tablespoons unsalted butter",
      "2 tablespoons chopped chives"
    ],

    "directions": [
      "Put the potatoes into a large pot, add the bay leaf, 2 tablespoons salt, and cover with cold water. ",
      "Bring to a boil over medium-high heat and cook until the potatoes are tender, about 20 minutes. ",
      "Drain them well and remove the bay leaf. ",
      "Meanwhile, heat the cream and butter in a small saucepan. ",
      "Put the potatoes through a ricer or food mill into a bowl. ",
      "Add the hot cream and season with salt and pepper. ",
      "Mix together with a spoon and add the chives."
    ]
  },
  
  {
      "id": 4001,
      "name": "Quick and Easy Apple Tart",
      "category": "Dessert",
      "summary": "Made this after seeing the episode and my husband had been asking for an apple puff pastry dessert. This was so easy & delicious! Definitely a keeper and will make again. I likely didn't use a full cup of brown sugar...just eyeballed it. No problems with uneven baking. I did add some small bite sized caramel bits to one of the tarts to see how that would bake up... awesome!",
      "img": {
        "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/8/23/0/WU0512H_quick-and-easy-apple-tart-recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1440089116251.jpeg",
        "height":620,
        "width":826
      },
      "level": "Easy",
      "totaltime": "30 min",
      "yield": 6,
      "ingredients": [
        "1 whole sheet puffed pastry, cut in half",
        "Nonstick cooking spray",
        "1 cup brown sugar ",
        "1/4 teaspoon salt",
        "Juice of 1/2 a lemon ",
        "3 whole apples, cored, halved and sliced, but not peeled ",
        "Store-bought caramel sauce, for serving",
        "1/4 cup chopped pecans"
      ],
      "directions": [
        "Preheat the oven to 425 degrees F.",
        "Place the puffed pastry rectangles onto a baking pan that's been sprayed with nonstick spray or lined with parchment paper. Add the sugar, salt and lemon juice to the apples. Stir to combine. Allow to sit for a few minutes.",
        "Arrange the apple slices on the pastry rectangles in a straight line, overlapping as you go. Bake until the pastry is puffed and golden brown, about 20 minute.",
        "Remove from the pan immediately and place on a serving platter. Serve with caramel sauce and chopped pecans."
      ]
    },
  

  {
    "id": 4002,
    "name": "Concord Grape Layer Cake",
    "category": "Dessert",
    "summary": "This is the type of cake that tastes scrumptious “chilled”. The frosting is amazing! The grape filling is out of this world and the cake is super moist. It’s a winner in my book and is the perfect dessert to serve and share with your family this fall. If you’re fortunate enough to find seedless concord grapes like I did then that’s so awesome but if you’re not so lucky then here is my tip.",
    "img": {
      "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/8/23/0/FNM_100116-Concord-Grape-Layer-Cake_s4x3.jpg.rend.hgtvcom.826.620.suffix/1480972866648.jpeg",
      "height":620,
      "width":826
    },
    "level": "Intermediate",
    "totaltime": "2 hr 20 min",
    "yield": 8,
    "ingredients": [
          "4 cups small seedless Concord grapes (about 2 pounds)*",
          "1 small Granny Smith apple, peeled and finely diced",
          "1/2 cup water",
          "1 cup granulated sugar",
          "Unsalted butter, for the pans",
          "3 3/4 cups all-purpose flour, plus more for the pans",
          "3/4 teaspoon baking soda",
          "1/2 teaspoon salt",
          "2 1/4 cups granulated sugar",
          "1 cup vegetable oil",
          "4 large eggs, at room temperature",
          "2 teaspoons pure vanilla extract",
          "1 1/2 cups buttermilk",
          "2 large pasteurized egg whites",
          "1 cup granulated sugar",
          "1 cup small seedless Concord grapes (about 1/2 pound)",
          "3 sticks unsalted butter, at room temperature",
          "Pinch of kosher salt",
          "4 cups confectioners' sugar, sifted",
          "2 teaspoons pure vanilla extract"
    ],
    "directions": [
          "Make the filling: Combine the grapes, apple and water in a medium Dutch oven over medium-low heat. Cover and cook until most of the grapes pop and shrivel, about 12 minutes. Increase the heat to medium and stir in the granulated sugar. Cook, stirring often and mashing with a potato masher occasionally to crush the apple, until the filling is thick and syrupy, 15 to 20 minutes. Remove from the heat and let cool completely.",
          "Make the cake: Preheat the oven to 350 degrees F. Butter and flour three 8-inch round cake pans; line the bottoms with parchment paper. Sift the flour, baking soda and salt into a medium bowl. Beat the granulated sugar and vegetable oil in a large bowl with a mixer on medium-high speed until it looks like wet sand, about 2 minutes. Scrape down the bowl and add the eggs, one at a time, beating well after each addition. Add the vanilla; beat on high speed until light, about 2 minutes. Reduce the mixer speed to low; beat in the flour mixture in three batches, alternating with the buttermilk, beginning and ending with the flour. Continue beating until smooth, about 1 minute.",
          "Divide the batter among the prepared pans and bake until a toothpick inserted into the centers comes out clean, 25 to 30 minutes. Let cool 10 minutes in the pans, then invert onto racks; remove the parchment and let cool completely.",
          "Meanwhile, make the topping: Line a rimmed baking sheet with parchment paper. Whisk the egg whites in a medium bowl until just foamy. Spread the granulated sugar in a pie plate or shallow bowl. Dip the grapes in the egg whites, letting any excess drip back into the bowl, then roll in the sugar. Transfer the sugared grapes to the prepared baking sheet. Freeze at least 30 minutes.",
          "Make the frosting: Beat the butter and salt in a large bowl with a mixer on medium speed until smooth and fluffy, about 2 minutes. Gradually beat in the confectioners' sugar, then the vanilla. Increase the mixer speed to medium high and beat until very light and fluffy, about 2 more minutes.",
          "Assemble the cake: Put 1 cake layer on a cake stand or serving plate. Spread about one-third of the grape filling on the cake, then top with another cake layer and half of the remaining filling. Top with the third cake layer. Cover the top and side of the cake with the frosting. Refrigerate to set the frosting, 15 to 20 minutes. Spread the remaining filling on top of the cake, leaving a 1/2-inch border. Arrange the frozen grapes around the border."
    ]
  },
          

  {
  "id": 4003,
  "name": "Apple Crumble with Vanilla Ice Cream",
  "category": "Dessert",
  "summary": "Very tasty and easy. Thank you ! I also use ginger, nutmeg and clove in addition to cinnamon. Other delicious recipe on the website Best of French Food. It was hard to not go back for a second helping. Will definately serve it to guests the next time we are grilling.",
  "img": {
  "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2007/10/15/0/GL0813_Apple_Cobbler.jpg.rend.hgtvcom.826.620.suffix/1384956344816.jpeg",
  "height":620,
  "width":826
  },
  "level": "Easy",
  "totaltime": "25 min",
  "yield": 4,
  "ingredients": [
          "4 Granny Smith apples, cut in half",
          "1/4 cup olive or canola oil",
          "1 stick (8 tablespoons) unsalted cold butter, melted",
          "8 tablespoons light brown sugar",
          "1 teaspoon ground cinnamon",
          "1/2 cup granola",
          "1 pint vanilla ice cream",
          "1/2 cup prepared caramel sauce, heated, optional"
  ],
  "directions": [
          "Heat the grill to medium.",
          "Place apples in a medium bowl and toss with the oil. Place the apples on the grill, cut-side down and grill until nicely browned. Flip the apples over and continue to grill until nicely browned on skin side. Remove from the grill and allow to cool briefly.",
          "Once they are cool enough to handle, core and cut the apples into wedges. Place the apple wedges into a bowl and toss with 1/2 teaspoon ground cinnamon, 4 tablespoons light brown sugar and 1/2 stick melted butter.",
          "In another bowl, toss together the remaining melted butter, cinnamon, light brown sugar and the granola.",
          "Place 1 large scoop of ice cream into 4 bowls and top with the apple mixture. Sprinkle the granola mixture over the top of the apple and drizzle with some of the caramel sauce, if using."
  ]
  },

          

  {
  "id": 4004,
  "name": "Bananas Foster Bread",
  "category": "Dessert",
  "summary": "This is the BEST banana bread I've ever made and tasted. It varies a bit away from the traditional banana bread in it's color (better...golden yellow instead of dark dry), crunchy crust, lack of nuts and fosters glaze, but it is so delicious. I bake my bread at altitude in Denver, CO, so I need to bake it about 15-20 minutes longer at the suggested 350 degrees, but I get a golden brown crunchy crust that is totally worth it. The addition of coconut oil and yogurt keep the consistency of the cake SO moist. The glaze softens the crust and crystallizes it to a yummy chewy, crunchy tooth. I'm in love with this recipe and will continue to make it every time someone wants banana bread.",
  "img": {
  "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2014/4/17/1/ZD0206H_Bananas-Foster-Bread_s4x3.jpg.rend.hgtvcom.826.620.suffix/1406092047622.jpeg",
  "height":620,
  "width": 826
  },
  "level": "Easy",
  "totaltime": "2 hr",
  "yield": 8,
  "ingredients": [
          "Cooking spray, for greasing",
          "4 medium-ripe bananas, mashed (1 2/3 cups)",
          "2 eggs",
          "1 cup granulated sugar",
          "1/2 cup coconut oil, melted",
          "3 tablespoons plain yogurt",
          "1 teaspoon rum extract",
          "1 teaspoon vanilla extract",
          "2 cups all-purpose flour",
          "1 teaspoon baking powder",
          "1/4 teaspoon salt",
          "4 tablespoons (1/2 stick) unsalted butter",
          "1/2 cup dark brown sugar",
          "1/4 cup spiced rum",
          "1 teaspoon orange zest",
          "Vanilla ice cream, for serving, optional"
  ],
  "directions": [
          "Preheat the oven to 350 degrees F. Spray a 9-by-4-inch loaf pan with cooking spray.",
          "Combine the bananas, eggs, sugar, coconut oil, yogurt, and rum and vanilla extracts in a bowl.",
          "In another, larger bowl, whisk together the flour, baking powder and salt.",
          "Make a well in the center of the dry ingredients. Pour the wet ingredients into the dry ingredients and stir until the flour is incorporated and batter is smooth. Pour the batter into the prepared loaf pan and bake until golden brown and a skewer inserted into the center of the loaf comes out clean, about 1 hour. Remove from the oven and set aside while you make the glaze.",
          "Melt the butter in a saucepan over medium heat. Add the brown sugar and 1/2 cup water and stir. Cook until the sugar dissolves, and then continue cooking another 3 to 5 minutes over low heat until the mixture bubbles around the edges. Turn off the heat and carefully (in case it flames) stir in the rum and the orange zest.",
          "Slowly pour half of the glaze over the banana bread, allowing it to seep into all the surfaces. Wait until the glaze has been absorbed, about 30 minutes, and then turn the loaf out of the pan.",
          "Slice and serve with vanilla ice cream, if using, and the remaining glaze."
  ]
  },


  {
  "id": 4005,
  "name": "Pots de Creme",
  "category": "Dessert",
  "summary": "Probably one of the easiest, best tasting and impressive desserts I've made. Any of the reviewers who say they followed the recipe exactly and it didn't turn out...really didn't follow the instructions. The eggs must be at room temperature and the coffee freshly brewed piping hot. I even preheated the measuring cup to make sure not to cool down the coffee at all. ",
  "img": {
  "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/9/17/3/WU0609H_Pots-de-Creme_s4x3.jpg.rend.hgtvcom.826.620.suffix/1397676971749.jpeg",
  "height": 620,
  "width": 826
  },
  "level": "Easy",
  "totaltime": "20 min",
  "yield": 6,
  "ingredients": [
          "9 ounces high-quality semisweet chocolate, chopped",
          "1 1/2 cups whole milk",
          "1 1/2 cups heavy cream",
          "6 large egg yolks",
          "5 tablespoons granulated sugar (add an extra tablespoon if using bitter chocolate)",
          "1/4 teaspoon salt",
          "1 tablespoon confectioners' sugar"
  ],
  "directions": [
          "Place the chocolate in a blender. Whisk the milk, 1 cup cream, egg yolks, granulated sugar and salt in a heavy-bottomed medium saucepan over medium heat. Cook, stirring constantly with a heatproof spatula, until the mixture is thick enough to coat the spatula and almost boiling, 5 to 6 minutes.",
          "Immediately pour the milk mixture over the chocolate in the blender. Cover and hold the lid with a thick kitchen towel; blend until combined and smooth, stopping to scrape down the sides of the blender as needed. Divide the chocolate mixture among ramekins or small cups and refrigerate until set, about 2 hours.",
          "Whip the remaining 1/2 cup cream and the confectioners' sugar with a mixer or in the blender until soft peaks form. Top the chilled pots de creme with whipped cream."
  ]
  },


  {
  "id": 4006,
  "name": "Pear Clafouti",
  "category": "Dessert",
  "summary": "This is very easy to make and tastes good. I added a little bit cinnamon and put half cream half milk. Maybe that's why it took me longer than 35-40 mins to bake. I baked almost 55 mins. Mine doesn't look as pretty as ina's. Really need to arrange the pear better next time.",
  "img": {
  "url": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2009/8/19/0/IG0505_Pear-Clafouti__s4x3.jpg.rend.hgtvcom.826.620.suffix/1431853047297.jpeg",
  "height": 620,
  "width": 826
  },
  "level": "Esay",
  "totaltime": "1 hr",
  "yield": 8,
  "ingredients": [
          "1 tablespoon unsalted butter, at room temperature",
          "1/3 cup plus 1 tablespoon granulated sugar",
          "3 extra-large eggs, at room temperature",
          "6 tablespoons all-purpose flour",
          "1 1/2 cups heavy cream",
          "2 teaspoons pure vanilla extract",
          "1 teaspoon grated lemon zest (2 lemons)",
          "1/4 teaspoon kosher salt",
          "2 tablespoons pear brandy (recommended: Poire William)",
          "2 to 3 firm but ripe Bartlett pears",
          "Confectioners' sugar",
          "Creme fraiche"
  ],
  "directions": [
          "Preheat the oven to 375 degrees F.",
          "Butter a 10 x 3 x 1 1/2-inch round baking dish and sprinkle the bottom and sides with 1 tablespoon of the granulated sugar.",
          "Beat the eggs and the 1/3 cup of granulated sugar in the bowl of an electric mixer fitted with the paddle attachment on medium-high speed until light and fluffy, about 3 minutes. On low speed, mix in the flour, cream, vanilla extract, lemon zest, salt, and pear brandy. Set aside for 10 minutes.",
          "Meanwhile, peel, quarter, core, and slice the pears. Arrange the slices in a single layer, slightly fanned out, in the baking dish. Pour the batter over the pears and bake until the top is golden brown and the custard is firm, 35 to 40 minutes. Serve warm or at room temperature, sprinkled with confectioners' sugar, and creme fraiche."
  ]
  }
]
